Revit 2016 API
IPipePressureDropServer Interface
 Interface for external servers implementing pipe pressure drop calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IPipePressureDropServer : IExternalServer
Visual Basic
Public Interface IPipePressureDropServer _
	Inherits IExternalServer
Visual C++
public interface class IPipePressureDropServer : IExternalServer
See Also
IPipePressureDropServer Members
Autodesk.Revit.DB.Plumbing Namespace